adafruit/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


adafruit_feather_m0.name=Adafruit Feather M0 (Native USB Port)
adafruit_feather_m0.vid.0=0x239A
adafruit_feather_m0.pid.0=0x800B
adafruit_feather_m0.vid.1=0x239A
adafruit_feather_m0.pid.1=0x000B
adafruit_feather_m0.upload.tool=bossac
adafruit_feather_m0.upload.protocol=sam-ba
adafruit_feather_m0.upload.maximum_size=262144
adafruit_feather_m0.upload.use_1200bps_touch=true
adafruit_feather_m0.upload.wait_for_upload_port=true
adafruit_feather_m0.upload.native_usb=true
adafruit_feather_m0.build.mcu=cortex-m0plus
adafruit_feather_m0.build.f_cpu=48000000L
adafruit_feather_m0.build.usb_product="Feather M0"
adafruit_feather_m0.build.usb_manufacturer="Adafruit"
adafruit_feather_m0.build.board=SAMD_FEATHER_M0
adafruit_feather_m0.build.core=arduino
adafruit_feather_m0.build.extra_flags=-DARDUINO_SAMD_ZERO -D__SAMD21G18A__ {build.usb_flags}
adafruit_feather_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m0.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_feather_m0.build.variant=arduino_zero
adafruit_feather_m0.build.variant_system_lib=
adafruit_feather_m0.build.vid=0x239A
adafruit_feather_m0.build.pid=0x800B
adafruit_feather_m0.bootloader.tool=openocd
adafruit_feather_m0.bootloader.file=feather/samd21_sam_ba.bin

#adafruit_radio_m0.name=Adafruit M0 Radio (Native USB Port)
#adafruit_radio_m0.vid.0=0x239A
#adafruit_radio_m0.pid.0=0x8014
#adafruit_radio_m0.vid.1=0x239A
#adafruit_radio_m0.pid.1=0x0014
#adafruit_radio_m0.upload.tool=bossac
#adafruit_radio_m0.upload.protocol=sam-ba
#adafruit_radio_m0.upload.maximum_size=262144
#adafruit_radio_m0.upload.use_1200bps_touch=true
#adafruit_radio_m0.upload.wait_for_upload_port=true
#adafruit_radio_m0.upload.native_usb=true
#adafruit_radio_m0.build.mcu=cortex-m0plus
#adafruit_radio_m0.build.f_cpu=48000000L
#adafruit_radio_m0.build.usb_product="Radio M0"
#adafruit_radio_m0.build.usb_manufacturer="Adafruit"
#adafruit_radio_m0.build.board=SAMD_ZERO
#adafruit_radio_m0.build.core=arduino
#adafruit_radio_m0.build.extra_flags=-D__SAMR21G18A__ {build.usb_flags}
#adafruit_radio_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
#adafruit_radio_m0.build.openocdscript=openocd_scripts/arduino_zero.cfg
#adafruit_radio_m0.build.variant=zero_radio
#adafruit_radio_m0.build.variant_system_lib=
#adafruit_radio_m0.build.vid=0x239A
#adafruit_radio_m0.build.pid=0x8014
#adafruit_radio_m0.bootloader.tool=openocd
#adafruit_radio_m0.bootloader.file=feather/samr21_sam_ba.bin

#adafruit_metro_m0.name=Adafruit Metro M0 (Native USB Port)
#adafruit_metro_m0.vid.0=0x239A
#adafruit_metro_m0.pid.0=0x8013
#adafruit_metro_m0.vid.1=0x239A
#adafruit_metro_m0.pid.1=0x0013
#adafruit_metro_m0.upload.tool=bossac
#adafruit_metro_m0.upload.protocol=sam-ba
#adafruit_metro_m0.upload.maximum_size=262144
#adafruit_metro_m0.upload.use_1200bps_touch=true
#adafruit_metro_m0.upload.wait_for_upload_port=true
#adafruit_metro_m0.upload.native_usb=true
#adafruit_metro_m0.build.mcu=cortex-m0plus
#adafruit_metro_m0.build.f_cpu=48000000L
#adafruit_metro_m0.build.usb_product="Metro M0"
#adafruit_metro_m0.build.usb_manufacturer="Adafruit"
#adafruit_metro_m0.build.board=SAMD_ZERO
#adafruit_metro_m0.build.core=arduino
#adafruit_metro_m0.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
#adafruit_metro_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
#adafruit_metro_m0.build.openocdscript=openocd_scripts/arduino_zero.cfg
#adafruit_metro_m0.build.variant=arduino_zero
#adafruit_metro_m0.build.variant_system_lib=
#adafruit_metro_m0.build.vid=0x239A
#adafruit_metro_m0.build.pid=0x8013
#adafruit_metro_m0.bootloader.tool=openocd
#adafruit_metro_m0.bootloader.file=metro/samd21_sam_ba.bin

# Atmel Xplained SAMR21G18A  (Progamming Port)
# ---------------------------------------
xplained_samr21g18a_edbg.name=Atmel Xplained SAMR21G18A (Programming Port)
xplained_samr21g18a_edbg.vid.0=0x03eb
xplained_samr21g18a_edbg.pid.0=0x2157

xplained_samr21g18a_edbg.upload.tool=openocd
xplained_samr21g18a_edbg.upload.protocol=sam-ba
xplained_samr21g18a_edbg.upload.maximum_size=262144
xplained_samr21g18a_edbg.upload.use_1200bps_touch=false
xplained_samr21g18a_edbg.upload.wait_for_upload_port=false
xplained_samr21g18a_edbg.upload.native_usb=false
xplained_samr21g18a_edbg.build.mcu=cortex-m0plus
xplained_samr21g18a_edbg.build.f_cpu=48000000L
xplained_samr21g18a_edbg.build.usb_product="Test"
xplained_samr21g18a_edbg.build.usb_manufacturer="Test LLC"
xplained_samr21g18a_edbg.build.board=SAMD_ZERO
xplained_samr21g18a_edbg.build.core=arduino
xplained_samr21g18a_edbg.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
xplained_samr21g18a_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
xplained_samr21g18a_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
xplained_samr21g18a_edbg.build.variant=xplained_samr21g18a
xplained_samr21g18a_edbg.build.variant_system_lib=
xplained_samr21g18a_edbg.build.vid=0x2341
xplained_samr21g18a_edbg.build.pid=0x804d
xplained_samr21g18a_edbg.bootloader.tool=openocd
xplained_samr21g18a_edbg.bootloader.file=zero/samd21_sam_ba.bin
